       IDENTIFICATION DIVISION. 
       PROGRAM-ID. hello.
       DATA DIVISION.
       PROCEDURE DIVISION.
       INICIO.
           DISPLAY "HELLO WORD!"
           EXIT.